# 字典的语法{key：value， key: value, ……}
my_dict1 = {"王力宏": 99, "周杰伦": 88, "林俊杰": 77}
print(f"my_dinctionary的内容是：{my_dict1}，类型是：{type(my_dict1)}")

my_dict2 = {"周杰伦": 99, "周杰伦": 98, "周杰伦": 96, "林俊杰": 77}
# 重复key留下后面的
print(f"重复key的字典内容是：{my_dict2}")

# 字典的数据获取
my_dict1 = {"王力宏": 99, "周杰伦": 88, "林俊杰": 77}
print(f"学生的分数是{my_dict1["王力宏"]}")
# key不可嵌套  value可以为任何

# 王力宏 语文77 数学66 英语33
# 周杰伦 语文88 数学86 英语55
# 林俊杰 语文99 数学96 英语66

grade = {"王力宏": {"语文": 77,
                   "数学": 66,
                   "英语": 33
                  },
         "周杰伦": {"语文": 88,
                   "数学": 86,
                   "英语": 55
                  },
         "林俊杰": {"语文": 99,
                   "数学": 96,
                   "英语": 66
                  }
         }
print(f"三个学生的成绩为{grade}")
score = grade["周杰伦"]
print(f"周杰伦的考试成绩是：{score}")
score = grade["周杰伦"]["数学"]
print(f"周杰伦的数学成绩是：{score}")

